[
  {
    "id": 31,
    "name": "Glucide Check - App iOS",
    "slug": "glucide-check-app-ios",
    "description": "Mon projet récent, \"Glucide-Check,\" est une application native iOS que j'ai développée en Swift. C'est mon premier projet d'application native mobile, conçu comme une aide précieuse pour les personnes diabétiques. L'application se compose de trois onglets principaux, chacun offrant des fonctionnalités essentielles pour la gestion de la glycémie.\n\nLe premier onglet permet aux utilisateurs de saisir leur glycémie actuelle et de calculer le nombre d'unités d'insuline nécessaires pour atteindre un taux de glycémie optimal. De plus, en cas d'hypoglycémie, l'application peut également calculer le nombre de carrés de sucre à consommer pour remonter la glycémie. Le second onglet offre un outil de \"calcul en croix\", utile pour estimer le nombre de glucides dans une portion d'un aliment. Les utilisateurs saisissent la valeur des glucides pour 100g, ainsi que la quantité qu'ils souhaitent manger, et l'application calcule le nombre total de glucides dans la portion.\n\nLe troisième onglet est dédié au paramétrage. Ici, les utilisateurs peuvent entrer des informations personnelles comme leur prénom, date de naissance, sexe, et poids, ce qui m'a permis de m'entraîner à la saisie de différents types de données. Les utilisateurs peuvent également définir des paramètres personnalisés, comme l'influence de l'insuline sur la glycémie, l'influence d'un carré de sucre, et la cible de glycémie souhaitée (taux minimal et maximal). En outre, l'application offre des options de personnalisation pour le mode sombre (clair, sombre, ou en accord avec le système d'exploitation) et permet de changer la langue de l'application.",
    "image": "projects/glucide-check-app-ios.png",
    "link": "",
    "github": "https://github.com/arthur-mdn/GlucideCheck-iOS",
    "youtube": [],
    "technos": [
      110,
      401
    ],
    "tags": [],
    "date": "2024-05-4",
    "status": "online",
    "type": "Application mobile"
  },
  {
    "id": 30,
    "name": "Programme Atlas",
    "slug": "site-vitrine-atlas-programme",
    "description": "J'ai récemment développé un site web sous WordPress pour un programme de sport personnalisé appelé \"Atlas\". Ce programme est un ensemble complet axé sur la musculation, la nutrition et le bien-être, conçu pour s'adapter aux besoins individuels des utilisateurs. Le site vise à promouvoir un corps esthétique et en pleine santé, tout en encourageant l'épanouissement physique et mental. Atlas est conçu pour rendre la transformation physique plus accessible et agréable, que ce soit pour les débutants ou les personnes déjà familiarisées avec ces disciplines.\n\nLa page d'accueil du site offre un aperçu du programme, mettant en avant ses principaux aspects et ses avantages. Elle inclut également des avis clients et des liens vers les réseaux sociaux. Une page dédiée explore en détail les différents thèmes abordés, notamment les plans d'entraînement, les plans nutritionnels et les plans de bien-être.\n\nLe site présente également une page de transformations, qui met en lumière les réussites des participants au programme, ainsi qu'une page de contact pour les visiteurs souhaitant en savoir plus ou poser des questions. Les utilisateurs ont la possibilité de mettre le programme Atlas dans leur panier et de payer directement sur le site, ce qui facilite l'inscription et l'accès au programme.",
    "image": "projects/site-web-programme-atlas.png",
    "link": "https://atlas-programme.fr",
    "github": "",
    "youtube": [],
    "technos": [
      101,102,103, 403
    ],
    "tags": [],
    "date": "2024-04-12",
    "status": "online",
    "type": "Site Web"
  },
  {
    "id": 29,
    "name": "Private Events - DJ Mika",
    "slug": "private-events-dj-mika",
    "description": "J’ai créé le site web \"Private Events\" pour DJ Mika, qui est une vitrine en ligne conçue pour mettre en lumière les services exceptionnels de DJing et de karaoké offerts par DJ Mika pour des événements privés et des soirées d'entreprise. Développé avec React, ce site présente une interface utilisateur élégante et responsive, reflétant l'ambiance dynamique et professionnelle que DJ Mika apporte à chaque événement.\nLe site web englobe une présentation des services de DJ Mika, offrant aux visiteurs une vue d'ensemble sur sa capacité à créer des ambiances musicales sur-mesure et des expériences de karaoké immersives. Les visiteurs peuvent explorer le répertoire musical diversifié de DJ Mika, qui s'étend des classiques intemporels aux hits contemporains, promettant une playlist personnalisée qui correspond parfaitement à l'atmosphère souhaitée pour chaque événement.\nUne section dédiée permet aux utilisateurs de télécharger librement un mix généraliste, couvrant des succès musicaux de 1970 à aujourd'hui, démontrant ainsi l'étendue et la flexibilité du talent musical de DJ Mika. Le site encourage également les visiteurs à soumettre leurs listes de 10 à 15 titres préférés, permettant à DJ Mika d'élaborer des sets musicaux personnalisés gratuitement.\nEn outre, le site met en avant l'engagement de DJ Mika à utiliser un équipement audiovisuel de haute qualité, assurant une expérience sonore et visuelle incomparable. Les témoignages de clients satisfaits viennent renforcer la réputation de DJ Mika, attestant de son habileté à transformer les soirées en moments inoubliables.\nLa portée géographique des services de DJ Mika est également mise en avant, soulignant sa disponibilité à travers le Vaucluse, le Var et les régions avoisinantes. Ce positionnement stratégique garantit une ambiance exceptionnelle pour des événements dans des lieux variés, de l'effervescence d'Avignon aux charmes côtiers de Saint-Tropez.\nLa réalisation de ce site avec React a permis de créer une expérience utilisateur fluide et attrayante, mettant en valeur le professionnalisme et la passion de DJ Mika pour la musique et le divertissement.",
    "image": "projects/djmika-private-events-website.png",
    "link": "https://privateevents.fr",
    "github": "https://github.com/arthur-mdn/private-events",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      105,
      106,
      109,
      401
    ],
    "tags": [],
    "date": "2024-03-25",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 28,
    "name": "Save The Turtles",
    "slug": "save-the-turtles",
    "description": "Save the Turtles est une initiative passionnante alliant la technologie Unity à la puissance de Python, spécifiquement en utilisant la bibliothèque YOLOv8 pour la reconnaissance et la localisation des joueurs à travers une caméra, telle que la webcam d'un ordinateur. Ce jeu interactif est conçu pour être projeté sur un mur, où les joueurs utilisent des mouvements physiques capturés par la caméra pour interagir avec le jeu, créant ainsi une expérience immersive sans l'usage traditionnel de clavier ou de souris.\n\nLa calibration et le traitement d'image, essentiels pour aligner précisément l'interaction dans l'espace de jeu, sont gérés via OpenCV. Cette étape est cruciale pour assurer que les mouvements des joueurs dans l'espace physique correspondent de manière fluide et précise aux actions dans le jeu. La détection des joueurs et la localisation des mains sont réalisées grâce à YOLOv8, permettant de suivre dynamiquement les mouvements des joueurs et d'intégrer ces informations dans le jeu Unity.\n\nLa communication entre Python et Unity est établie via des sockets, facilitant une interaction en temps réel entre la capture des mouvements et leur répercussion dans le jeu. Cette synergie entre les deux plateformes est fondamentale pour le gameplay interactif de \"Save the Turtles\".\n\nLe concept du jeu est à la fois ludique et éducatif. Les joueurs sont chargés de protéger des tortues virtuelles se déplaçant de la gauche vers la droite de l'écran, en les sauvant des crabes qui tentent de les attaquer. À l'aide d'une main virtuelle et d'une épuisette, les joueurs attrapent les crabes pour assurer la sécurité des tortues. Le jeu comporte un système de vies, avec des tortues perdant une vie à chaque fois qu'elles sont touchées par un crabe, et le jeu se termine lorsque toutes les vies sont perdues.\n\nL'aspect visuel du jeu, y compris le logo, les indicateurs de vie, et la scène 3D, a été entièrement conçu par moi. La gestion des apparitions aléatoires des tortues et des crabes, ainsi que le système de scoring, ajoutent une dimension supplémentaire au jeu, offrant une expérience riche et engageante.\n\nCe projet est inspiré d'un événement réel où une tortue protégée a pondu hors de son habitat habituel, un événement qui a été protégé par les autorités locales. \"Save the Turtles\" rend hommage à cet événement, sensibilisant les joueurs à la protection des espèces menacées.\n\nLe projet est open source, disponible sur GitHub, accompagné de vidéos explicatives sur YouTube présentant à la fois les coulisses du développement et une démonstration du jeu. Cette initiative personnelle illustre mon aptitude à fusionner créativité, technologie, et engagement écologique dans le développement de solutions de divertissement innovantes et significatives. C'est un projet universitaire qui a été réalisé dans le cadre de ma 3ème année du Bachelor BUT MMI (Métiers du Multimédia et de l'Internet) spécialisation Dév, à l'université de Toulon, Campus Porte d'Italie. Ce projet démontre ma capacité à appliquer mes compétences techniques à des projets concrets et engageants.",
    "image": "projects/save_the_turtles.png",
    "link": "",
    "github": "https://github.com/arthur-mdn/UnityPythonInteractiveGame_SaveTheTurtles",
    "youtube": [
      {
        "id": "K8k6RFVC_Io",
        "title": "Démonstration du jeu Save The Turtles - Jeu interactif et innovant ! Unity + Python (Yolo V8)",
        "image": "https://img.youtube.com/vi/K8k6RFVC_Io/0.jpg",
        "link": "https://www.youtube.com/watch?v=K8k6RFVC_Io"
      },
      {
        "id": "G4kqt2PyODY",
        "title": "Présentation et coulisses du jeu interactif innovant Save The Turtles",
        "image": "https://img.youtube.com/vi/G4kqt2PyODY/0.jpg",
        "link": "https://www.youtube.com/watch?v=G4kqt2PyODY"
      }
    ],
    "disclaimer": "",
    "technos": [
      203,
      204,
      404,
      401,
      108
    ],
    "tags": [
      "Python",
      "Unity"
    ],
    "date": "2024-02-01",
    "status": "online",
    "type": "Jeu vidéo"
  },
  {
    "id": 25,
    "name": "Réseau Mistral",
    "slug": "reseau-mistral",
    "description": "Ce projet est une application web complexe et multifonctionnelle pour la validation des titres de transport, utilisée pour les bus et les bateaux. Développée avec React et Node.js, cette application est également gérée via Docker, offrant ainsi une solution robuste et scalable.\n\nL'application permet aux utilisateurs de se créer un compte et d'associer plusieurs profils à ce compte, ce qui est particulièrement utile pour les familles ou les groupes. Une fois inscrits, les utilisateurs ont la possibilité d'acheter différents types de tickets selon leurs besoins de voyage. Les tickets sont diversifiés, comprenant des options pour les voyages terrestres (bus) et maritimes (bateaux), ainsi que des abonnements, tels que des tickets hebdomadaires, offrant une flexibilité et une commodité maximales.\n\nL'un des aspects les plus innovants de l'application est la fonction de scan de QR code. Lorsqu'un utilisateur monte dans un bus, il peut scanner un QR code spécifique à ce véhicule, ce qui valide un ticket d'une heure. Cette fonctionnalité rend l'utilisation des transports en commun plus efficace et plus pratique, réduisant le besoin de tickets physiques et accélérant le processus d'embarquement.\n\nEn plus de la vente et de la validation des tickets, l'application est équipée d'une interface de contrôle pour les agents de contrôle des transports. Cette interface permet de vérifier facilement la validité des tickets des passagers, assurant ainsi la conformité et la sécurité du système de transport.\n\nCe projet, impliquant React, Node.js et MongoDB pour la gestion des données, est un exemple de mon expertise en matière de développement de solutions web complètes et modernes. Il démontre ma capacité à créer des applications fonctionnelles et conviviales, tout en répondant aux besoins spécifiques d'un secteur d'activité tel que le transport public. La gestion via Docker assure une mise en œuvre et un déploiement efficaces, soulignant mon engagement à adopter des technologies de pointe pour offrir des solutions performantes et évolutives.",
    "image": "projects/reseau-mistral.png",
    "link": "https://reseau-mistral.mondon.pro",
    "github": "https://github.com/arthur-mdn/reseau-mistral",
    "youtube": [],
    "disclaimer": "Ce projet est une <strong>simulation</strong> à des fins <strong>éducatives et démonstratives</strong> de l'application de validation de tickets de transports <strong>M-Tickets - Réseau mistral</strong> pour Toulon Métropole. Conçue pour mettre en valeur mes aptitudes en React et Node.js. <strong>Son usage dans un contexte réel ou quotidien est strictement interdit</strong>. Cette application n'a aucun lien avec l'application originale et <strong>ne doit pas être utilisée</strong> comme telle. Tous les éléments de propriété intellectuelle appartiennent à leurs détenteurs respectifs. <strong>Je décline toute responsabilité</strong> en cas d'utilisation inappropriée de cette simulation. Une bannière d'avertissement est continuellement visible sur le site, servant de rappel des conditions d'utilisation afin de prévenir tout emploi illicite de l'application.",
    "technos": [
      101,
      102,
      103,
      105,
      106,
      302,
      402,
      401
    ],
    "tags": [],
    "date": "2024-01-16",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 24,
    "name": "Site Portfolio",
    "slug": "site-portfolio",
    "description": "Mon site portfolio, actuellement accessible en ligne, est une vitrine de mon parcours professionnel en tant que développeur web. Réalisé en React et Vite, ce site reflète et affiche ma maîtrise de diverses technologies. Il présente une interface utilisateur intuitive et moderne, conçue pour offrir une expérience fluide aux visiteurs souhaitant explorer mon univers professionnel.\n\nSur ce site, je mets en avant mes projets publics, chacun accompagné d'une description, des technologies utilisées, et des liens vers des ressources supplémentaires comme GitHub ou des démonstrations en ligne. Cette section permet aux visiteurs de se plonger dans mes travaux, reflétant ma capacité à mener à bien des projets variés et complexes.\n\nIl est également possible pour les visiteurs de télécharger directement mon CV, offrant ainsi un accès immédiat à mes qualifications et à mon parcours professionnel. De plus, le site intègre un formulaire de contact, facilitant la communication avec les clients potentiels, les employeurs ou les collaborateurs intéressés par mon profil et mes services.\n\nL'esthétique et la performance du site, grâce à l'utilisation de React et Vite, témoignent de mon engagement à offrir une expérience utilisateur de qualité. Le design est à la fois élégant et fonctionnel, et le site est optimisé pour une navigation rapide et réactive. En rendant le code source du site disponible dans un repository public, je démontre également mon intérêt pour la transparence et le partage de connaissances avec la communauté des développeurs.\n\nEn résumé, mon site portfolio est non seulement une représentation de mes compétences techniques et de mon expérience en développement web, mais aussi une plateforme interactive où les visiteurs peuvent découvrir mon univers professionnel, mes réalisations, et entrer en contact avec moi. C'est un outil essentiel dans ma démarche de mise en valeur de mon profil professionnel et de connexion avec le monde du développement web. Mon site portfolio, qui se veut être le miroir de mon parcours en tant que développeur web, a récemment connu une évolution significative. En plus de la version initiale développée avec React et Vite, le projet a été réintégré en utilisant Next.js en combinaison avec React. Cette transition vers Next.js a été motivée par la volonté d'améliorer l'optimisation SEO du site, en particulier pour intégrer le Server-Side Rendering (SSR) des métadonnées dans l'en-tête de chaque page. Cette amélioration technique vise à renforcer la visibilité et l'accessibilité du site dans les moteurs de recherche, ce qui est essentiel pour atteindre un public plus large.\n\nCette démarche illustre non seulement mon engagement à adopter les meilleures pratiques en matière de développement web, mais aussi ma capacité à évoluer et à réagir aux exigences changeantes du domaine, tout en cherchant constamment à améliorer l'expérience utilisateur et la performance du site. Les deux versions du site, celle basée sur Vite/React et la nouvelle version avec Next/React, sont accessibles sur mon repository GitHub. Cette coexistence offre une transparence totale sur mon processus de développement et souligne mon aptitude à maîtriser différentes approches et technologies dans la réalisation de projets web.",
    "image": "projects/site-portfolio.png",
    "link": "",
    "github": "https://github.com/arthur-mdn/portfolio",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      105,
      106,
      109,
      401
    ],
    "tags": [],
    "date": "2024-02-20",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 1,
    "name": "Du Kart à la F1",
    "slug": "du-kart-a-la-f1",
    "description": "Création d'un site vitrine moderne et réactif pour un événement de karting organisé par AGS F1. Ce site, développé avec expertise en React, offre une expérience utilisateur fluide et captivante. Il se distingue par son module de traduction en temps réel, garantissant une accessibilité globale et une communication sans frontières. En outre, le site est enrichi de fonctionnalités interactives qui engagent et captivent les visiteurs, les immergeant pleinement dans l'univers passionnant du karting. L'intégration d'API tierces, telles que TikTok et YourPlan, ajoute une dimension supplémentaire, permettant une interaction dynamique et une diffusion plus large de l'événement. Ce projet illustre ma capacité à fusionner technologie de pointe et créativité pour créer des expériences digitales mémorables et efficaces, renforçant la présence en ligne de l'événement de karting et capturant l'essence du frisson de la course, du kart à la F1.",
    "image": "projects/dukartalaf1.png",
    "link": "https://kart.mondon.pro",
    "github": "https://github.com/arthur-mdn/kartf1",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      105,
      401
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "React"
    ],
    "date": "2023-12-19",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 2,
    "name": "Buzzer-App",
    "slug": "buzzer-app",
    "description": "Présentation de \"Buzzer App\", mon projet innovant qui transforme vos soirées en moments de jeu interactif et dynamique. Cette application progressive web en React, MongoDB et Socket.io offre une expérience de buzzer en temps réel, idéale pour animer des jeux comme les blind tests. Inspirée d'une situation réelle où la détermination du joueur le plus rapide était source de confusion, j'ai conçu cette solution universelle compatible Android et iOS, sans les contraintes des connexions WiFi ou Bluetooth.\n\nLe design, inspiré des jeux vidéo, est à la fois attrayant et fonctionnel. Avec une gestion de serveur intégrée, les utilisateurs peuvent rejoindre ou créer des sessions de jeu, et même gérer les participants. Des options de personnalisation, telles que le réglage des points pour gagner, l'ajout ou le retrait de points pour les réponses, et la possibilité de rendre le serveur public ou privé, enrichissent l'expérience.\n\nL'aspect communautaire est renforcé par la visibilité en ligne des membres, le suivi des scores, et la facilité de partage des serveurs de jeu via QR code ou lien direct. La première connexion invite à créer un profil personnalisé avec nom et photo, modifiables ultérieurement dans les paramètres. Enfin, l'application permet aux utilisateurs de choisir leur thème en modifiant le fond d'écran, stocké en local storage, pour une expérience encore plus personnalisée. \"Buzzer App\" est l'exemple parfait de ma capacité à fusionner créativité, technologie et utilité pratique pour créer des solutions numériques engageantes et innovantes.",
    "image": "projects/buzzer-app.png",
    "link": "https://buzzer-app.fr",
    "github": "https://github.com/arthur-mdn/buzzer-app",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      105,
      201,
      108,
      302,
      401
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "React",
      "NodeJS",
      "Socket.io",
      "MongoDB",
      "GIT"
    ],
    "date": "2023-11-26",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 26,
    "name": "Cookie Remover",
    "slug": "cookie-remover",
    "description": "Cookie Remover est une extension de navigateur que j'ai développée pour Chrome et Edge, destinée à simplifier la navigation en ligne en supprimant automatiquement les bannières de cookies et les mentions légales RGPD. Cette extension est spécialement conçue pour les utilisateurs qui souhaitent une expérience de navigation plus fluide et sans interruption, en particulier sur les sites qui bloquent le contenu si les cookies ne sont pas acceptés.\n\nL'extension comporte plusieurs fonctionnalités clés :\n\nNettoyage en un clic : Un bouton permet aux utilisateurs de nettoyer instantanément la page actuelle en supprimant toutes les bannières de cookies et autres pop-ups. Cette action est réalisée en injectant du JavaScript directement dans le navigateur pour manipuler le DOM.\n\nOnglet 'Ajouter' pour Personnalisation : Les utilisateurs peuvent ajouter des actions spécifiques pour différents éléments HTML d'une page. Ils peuvent choisir de cibler ces éléments par ID, classe, ou Query Selector. Les actions possibles incluent cacher l'élément, ajouter ou supprimer une classe, ou ajouter du style directement.\n\nSélection Rapide : Cette fonctionnalité facilite la sélection d'éléments HTML directement dans le navigateur, avec une visualisation interactive pour une meilleure précision.\n\nListe des Actions : L'extension maintient une liste des actions personnalisées créées par l'utilisateur, avec des détails tels que le sélecteur, l'action effectuée, la date d'ajout, et le site web concerné.\n\nHistorique : L'onglet historique enregistre chaque action réalisée par l'extension, offrant une transparence totale sur les modifications apportées aux pages web visitées.\n\nParamètres : Les utilisateurs peuvent activer un mode sombre, choisir des options de nettoyage plus agressives, gérer l'historique pour optimiser les performances, et gérer les sites exclus du nettoyage automatique. L'extension permet également d'exporter et d'importer des paramètres pour une personnalisation aisée entre différents appareils.\n\nCookie Remover est un exemple de ma capacité à créer des outils numériques innovants et utiles, conçus pour améliorer l'expérience utilisateur sur le web. Cette extension représente mon engagement à résoudre les problèmes courants rencontrés par les utilisateurs de navigateurs internet, en offrant une solution personnalisable et efficace.",
    "image": "projects/cookie-remover.png",
    "link": "",
    "github": "https://github.com/arthur-mdn/cookie-remover",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      401
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "React",
      "NodeJS",
      "Socket.io",
      "MongoDB",
      "GIT"
    ],
    "date": "2023-08-25",
    "status": "online",
    "type": "Extension de navigateur"
  },
  {
    "id": 3,
    "name": "Noctivibe",
    "slug": "noctivibe",
    "description": "Noctvibe est une progressive web app (PWA) en PHP conçue pour simplifier l'organisation de soirées culinaires. L'application est née d'une expérience personnelle lors de l'organisation de soirées pizza en famille, où la coordination des préférences et des commandes était une tâche complexe et source de confusion.\n\nAvec \"Noctvibe\", l'organisation d'événements devient un jeu d'enfant. L'utilisateur peut créer un événement en spécifiant son titre, le type de repas (comme une pizza ou un menu personnalisé), le lieu, la date et la liste des invités. Unsplash est intégré pour ajouter une touche esthétique avec des photos thématiques, rendant l'invitation plus attrayante.\n\nUne fois l'événement créé, un lien d'invitation partageable permet aux invités d'accéder à la plateforme. Chaque invité sélectionne ses ingrédients préférés parmi une liste complète, offrant une personnalisation complète de sa commande. Les modifications de dernière minute sont également prises en compte, permettant aux invités de revenir sur leurs choix.\n\nDu côté de l'organisateur, \"Noctvibe\" offre une vue d'ensemble claire : une liste complète des ingrédients nécessaires et le détail de chaque commande, facilitant considérablement la préparation. Cette application est le reflet de ma capacité à transformer les défis du quotidien en solutions numériques élégantes et fonctionnelles, améliorant l'expérience de l'organisation d'événements tout en minimisant les tracas.",
    "image": "projects/noctivibe.png",
    "link": "https://demo.noctivibe.fr",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2023-08-07",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 6,
    "name": "PWA Factures et Dépenses",
    "slug": "factures-et-depenses",
    "description": "\"Facture\" est une progressive web app innovante que j'ai conçue pour simplifier la gestion des dépenses des enfants, tout en impliquant les parents dans le processus. Cette application sert de pont numérique entre les enfants et leurs parents, offrant une solution transparente et efficace pour la gestion financière familiale.\n\nDans \"Facture\", les comptes enfants sont liés à ceux des parents, avec la possibilité pour un parent de gérer plusieurs enfants. Les enfants peuvent saisir leurs dépenses en détaillant le titre, la description, le montant, la date et le type de dépense. Ils ont également la possibilité d'ajouter un justificatif d'achat et de demander un remboursement.\n\nL'application offre un historique clair où les enfants peuvent voir si leurs dépenses ont été acceptées ou refusées, avec les raisons associées. Du côté des parents, \"Facture\" permet de gérer les dépenses de manière flexible : acceptation ou refus de dépenses multiples, paiement total ou partiel, déduction ou ajout de montants spécifiques.\n\nLes parents ont accès aux profils de tous leurs enfants, pouvant examiner et gérer les dépenses de chacun individuellement. Bien que l'application ne gère pas directement les transactions financières, elle facilite la communication et la prise de décision en matière de finances familiales, avec la possibilité de réaliser les paiements via d'autres moyens, comme les virements bancaires.\n\n\"Facture\" illustre mon engagement à créer des solutions numériques qui répondent aux besoins quotidiens des familles, en combinant fonctionnalité, facilité d'utilisation et une approche centrée sur l'utilisateur pour une gestion financière familiale plus organisée et transparente.\n\n\n\n\n\n\n",
    "image": "projects/facture.png",
    "link": "https://facture.mondon.pro/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "React",
      "MySQL"
    ],
    "date": "2022-01-21",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 13,
    "name": "Générateur de Signatures Email",
    "slug": "generateur-de-signatures-email",
    "description": "Lors de mon alternance chez Edyssium Consulting, j'ai été confronté à la tâche répétitive de créer des signatures mail personnalisées pour chaque nouvel arrivant ou événement spécifique, comme l'ajout de cartes de vœux en fin d'année. Pour résoudre ce défi, j'ai développé un générateur de signatures mail innovant, conçu pour automatiser et simplifier ce processus.\n\nCe générateur est basé sur un formulaire utilisateur dans lequel on peut entrer des informations telles que le pseudo, le nom, le prénom, le rôle dans l'entreprise, le numéro de téléphone, ainsi que l'option d'intégrer une image. L'une des caractéristiques clés de cet outil est la capacité de choisir le type de signature souhaité, adapté soit pour Thunderbird, soit pour Outlook.\n\nUne fois le formulaire soumis, le générateur, alimenté par PHP en arrière-plan, crée un template d'email personnalisé. Il intègre automatiquement les informations fournies dans le formulaire, générant ainsi une signature mail prête à l'emploi. L'utilisateur peut alors simplement télécharger cette signature et la glisser-déposer dans le dossier de signatures de son application de messagerie.\n\nCe projet, développé en PHP, est un exemple parfait de la manière dont je peux apporter des solutions numériques pratiques et efficaces pour optimiser les processus administratifs. Le générateur de signatures mail a non seulement amélioré l'efficacité au sein d'Edytium Consulting, mais a également démontré mon aptitude à innover et à résoudre des problèmes courants par des moyens technologiques.",
    "image": "projects/mailgenerator.png",
    "link": "",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      107,
      202
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP"
    ],
    "date": "2023-01-16",
    "status": "online",
    "type": "Outil"
  },
  {
    "id": 15,
    "name": "Cinephony",
    "slug": "cinephony",
    "description": "Dans le cadre d'un projet étudiant en 2ème année de BUT MMI, j'ai développé un site web catalogue de films et de livres, une plateforme robuste et dynamique construite avec PHP et MySQL, suivant la structure MVC (Modèle-Vue-Contrôleur) et orientée objet. Ce site se distingue par sa gestion détaillée des objets de livres et de films.\n\nLes informations sur les films sont récupérées via l'API TheMovieDB, permettant d'accéder à un large éventail de détails : images, plateformes de visionnage, descriptions, synopsis, informations sur la production. Une fonctionnalité intéressante est la possibilité de cliquer sur une maison de production pour voir tous les films associés. Les utilisateurs peuvent également explorer des détails spécifiques tels que le budget, les revenus, la date de sortie, et le site web du film, ainsi que la liste complète du casting. En cliquant sur un membre du casting, ils peuvent voir d'autres films auxquels cette personne a participé.\n\nLa gestion des notes et des commentaires est une autre fonctionnalité clé, nécessitant une connexion utilisateur pour ajouter un commentaire ou une note. De plus, le site intègre une fonction de recherche sophistiquée, avec des requêtes Ajax affichant en temps réel les résultats cliquables, offrant ainsi une expérience utilisateur fluide et interactive.\n\nLe panel administratif du site permet d'ajouter des livres ou des films, donnant aux administrateurs un contrôle total sur le contenu disponible. Ce projet étudiant illustre ma capacité à créer des solutions web complexes et fonctionnelles, mettant en valeur mon expertise technique en développement web ainsi que ma passion pour la mise en œuvre de systèmes informatiques interactifs et utilisateurs.",
    "image": "projects/cinephony.png",
    "link": "https://cinephony.mondon.pro/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301,
      401
    ],
    "tags": [
      "PHP",
      "MySQL",
      "Git"
    ],
    "date": "2023-05-28",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 7,
    "name": "EDT - PWA Emploi du Temps Université",
    "slug": "edt-pwa-emploi-du-temps-universite",
    "description": "\n\"EDT\" est une progressive web app que j'ai conçue pour améliorer la gestion de l'emploi du temps des étudiants à l'Université de Toulon, en utilisant PHP et MySQL. Cette application s'interface avec hyperplanning, un outil de planification académique, pour offrir une expérience utilisateur personnalisée et efficace.\n\nL'application permet aux étudiants de récupérer et de gérer leur emploi du temps en téléchargeant le fichier ICS depuis hyperplanning. Chaque requête assure que l'emploi du temps est constamment mis à jour. Les utilisateurs peuvent ajouter plusieurs calendriers, les modifier, et choisir entre différentes vues (mois, semaine, jour). Ils peuvent également personnaliser le calendrier, comme la plage horaire d'affichage, la couleur par défaut des événements, et activer des filtres spécifiques. Par exemple, un filtre \"entreprise\" pour les étudiants en alternance, permettant de différencier facilement les jours de cours des jours en entreprise.\n\nLa page d'accueil affiche le calendrier selon les paramètres choisis, avec des options pour changer la vue ou ajouter des événements personnels. La fonction de recherche permet de filtrer les cours, les salles, les noms des professeurs, ou les matières. De plus, un bouton pratique sur la page d'accueil permet aux étudiants d'afficher rapidement leur carte d'étudiant pour un accès facile à l'université.\n\n\"EDT\" propose également une fonctionnalité de groupe, permettant aux étudiants de rejoindre ou de créer des groupes de classe. Au sein de ces groupes, ils peuvent accéder à un chat, une liste de tâches (comme les contrôles et les devoirs) avec des dates butoirs, et visualiser la liste des membres du groupe, avec l'option de le quitter.\n\nPour les administrateurs, l'application offre un panel de contrôle en temps réel pour surveiller l'utilisation de l'application, le nombre d'utilisateurs, les dernières connexions et le nombre de calendriers. Ils peuvent également envoyer des messages aux utilisateurs, qui s'affichent en plein écran lors du lancement de l'application.\n\n\"EDT\" est une démonstration de ma capacité à créer des solutions numériques intuitives et fonctionnelles, visant à améliorer l'expérience universitaire et à faciliter la gestion du temps pour les étudiants.",
    "image": "projects/edt.png",
    "link": "https://edt.mondon.pro",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2021-09-22",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 17,
    "name": "Création de Visites Virtuelles",
    "slug": "visites-virtuelles",
    "description": "\nParallèlement à mes autres projets, j'ai développé une expertise dans la création de visites virtuelles, en utilisant une caméra 360 Insta360 pour capturer des images et intégrer une expérience immersive de navigation dans divers établissements. Ce projet combine technologie avancée et créativité pour offrir des expériences interactives uniques.\n\nUn exemple marquant est la visite virtuelle que j'ai réalisée pour l'entreprise où je réalise mon alternance. J'ai innové en intégrant des éléments ludiques tels qu'une chasse au trésor, où les participants doivent trouver des peluches cachées dans différents endroits de l'entreprise. Cette quête, en plus d'être divertissante, permet aux participants de s'engager activement avec l'environnement virtuel. À la fin de la chasse, les participants peuvent s'inscrire dans un tableau des scores, ajoutant un élément de compétition amusant à l'expérience.\n\nLes visites virtuelles que je crée offrent de nombreux avantages. Elles permettent aux utilisateurs d'explorer des lieux à distance, ce qui est particulièrement utile pour des événements comme les journées portes ouvertes ou la présentation d'espaces de travail. Les transitions soignées et les animations entre les différents points de vue assurent une expérience utilisateur fluide et agréable. De plus, l'ajout de mini-jeux ou d'activités interactives accroît l'engagement et l'intérêt des utilisateurs.\n\nCes visites virtuelles sont des outils polyvalents et précieux pour toute entreprise ou institution souhaitant promouvoir ses espaces de manière innovante et interactive. Elles démontrent ma capacité à fusionner la photographie, la technologie et la conception de jeux pour créer des expériences numériques captivantes et mémorables.",
    "image": "projects/visites_virtuelles.png",
    "link": "https://visites.eradion.fr",
    "github": "",
    "youtube": [],
    "technos": [],
    "tags": [
      "3D Modeling",
      "Web Development"
    ],
    "date": "2023-04-18",
    "status": "online",
    "type": "Visite virtuelle"
  },
  {
    "id": 21,
    "name": "Eradion.fr",
    "slug": "eradion",
    "description": "Eradion est le site web de mon auto-entreprise, un projet personnel qui reflète mes compétences et ma passion pour le développement web, la création de visites virtuelles et la production audiovisuelle. J'ai codé ce site en PHP, HTML et JavaScript, avec une attention particulière portée à l'optimisation SEO pour assurer une bonne visibilité en ligne.\n\nLe design du site est moderne et professionnel, reflétant mon expertise dans ces domaines. La section actualités, qui comprend un blog, permet de mettre à jour les visiteurs sur les dernières tendances, projets et réalisations. La gestion des posts est intégrée, permettant un partage régulier de contenu pertinent et engageant.\n\nEn plus des actualités, le site présente un portfolio de mes travaux antérieurs, avec une mise en avant de divers projets en visites virtuelles et en développement web. Cela donne aux visiteurs un aperçu concret de mes compétences et de mon expérience dans ces domaines.\n\n\"Eradion\" sert non seulement de vitrine pour mon travail, mais aussi comme un moyen de connecter avec des clients potentiels et des partenaires. Le site illustre ma capacité à combiner la créativité avec la technologie pour créer des solutions numériques uniques, et ma détermination à fournir des services de haute qualité dans le domaine du développement web et de la production audiovisuelle.",
    "image": "projects/eradion.png",
    "link": "https://eradion.fr",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "Web Development"
    ],
    "date": "2023-03-21",
    "status": "online",
    "type": "Site Web"
  },
  {
    "id": 8,
    "name": "Écran d'Aide à la Navigation",
    "slug": "ecran-d-aide-a-la-navigation",
    "description": "Un système d'affichage dynamique basé sur Raspberry Pi, destiné à fournir des informations pratiques et visuelles sur un écran. Ce dispositif polyvalent affiche une variété de contenus interactifs, rendant l'information à la fois accessible et engageante.\n\nLe Raspberry Pi est configuré pour afficher une page web animée montrant le logo de l'entreprise, la météo actuelle, la date et le jour, ainsi que des icônes spécifiques. Au cœur de l'écran, des directives sous forme de flèches indiquent divers emplacements tels que l'ascenseur, le rez-de-chaussée ou l'infirmerie. À côté de ces indications, un slider tourne en boucle, montrant des photos sélectionnées, tandis qu'un texte défilant en bas de l'écran communique des informations pratiques, comme les horaires d'ouverture du secrétariat.\n\nCe système inclut un panel administratif permettant d'ajouter, de supprimer ou de modifier les directives, l'orientation des flèches, les photos ou les icônes. Une fonctionnalité notable est le mode sombre programmable, qui réduit la consommation électrique sur les écrans OLED, particulièrement utile pendant les heures creuses.\n\nLa gestion des horaires est également une composante clé de ce système. L'affichage peut être programmé pour indiquer différents statuts en fonction des heures, comme les heures d'ouverture ou de fermeture du secrétariat, avec des couleurs de fond personnalisables pour chaque plage horaire.\n\nEn outre, le dispositif intègre une fonctionnalité météo en temps réel, utilisant l'API d'Owen Weather. Il récupère automatiquement des informations telles que le nom de la ville, la température, l'état du ciel, et affiche une icône correspondante (soleil, nuages, pluie, etc.), basée sur la localisation GPS actuelle.\n\nCe projet illustre mon aptitude à créer des solutions numériques personnalisées et interactives, qui améliorent l'expérience utilisateur tout en fournissant des informations essentielles de manière intuitive et esthétique.",
    "image": "projects/interactive-screen-display.png",
    "link": "",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2023-01-05",
    "status": "online",
    "type": "Écran interactif"
  },
  {
    "id": 9,
    "name": "Funkylike",
    "slug": "funkylike",
    "description": "Funkylike est une application web que j'ai développée, offrant un service de compteur en temps réel des abonnés sur Facebook et Instagram. Utilisant PHP et MySQL, cette application permet aux utilisateurs de se connecter, d'accéder à leur profil et de choisir entre différentes formules d'abonnement, avec des options gratuites et payantes.\n\nLes utilisateurs peuvent intégrer une page Facebook ou Instagram en se connectant via l'API respective. Après connexion et autorisation, un token est généré, permettant de récupérer en temps réel des informations telles que l'image de la page, le nom, et surtout, le nombre d'abonnés. Ces données sont ensuite affichées sur la page d'accueil de l'utilisateur avec une mise en page dynamique.\n\nChaque compteur peut être personnalisé avec un fond d'écran différent. Sur la page d'accueil, le compteur s'affiche en plein écran, montrant le nom de la page Facebook ou Instagram, le logo correspondant, et le nombre d'abonnés en temps réel grâce à la librairie \"flip\", qui anime le changement des chiffres.\n\nFunkylike comprend également une interface d'administration avancée. Les administrateurs peuvent modifier la fréquence de rafraîchissement des compteurs, définir une période d'inactivité après laquelle la barre de menu se cache, et gérer la publicité pour les comptes gratuits. Les utilisateurs premium bénéficient de fonctionnalités supplémentaires, telles que l'absence de publicité et un nombre illimité de compteurs.\n\nCette application est particulièrement utile pour les commerçants souhaitant encourager les abonnements en temps réel. Elle permet aux clients de voir le nombre d'abonnés augmenter instantanément, créant un effet incitatif. Avec ses différentes formules, de la version gratuite avec publicité à la version premium sans limite et sans publicité, Funkylike offre une flexibilité adaptée aux besoins de chaque utilisateur. Ce projet démontre ma capacité à développer des solutions web interactives et utiles pour le marketing et la promotion en ligne.",
    "image": "projects/funkylike.png",
    "link": "https://app.funkylike.com",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2022-09-25",
    "status": "online",
    "type": "Écran interactif"
  },
  {
    "id": 10,
    "name": "Calendry",
    "slug": "calendry",
    "description": "Calendry est un projet web que j'ai développé pour la gestion de réservations en ligne pour un salon de coiffure ou un établissement de beauté. Ce site offre une interface utilisateur riche et une expérience administrateur complète, rendant la prise de rendez-vous et la gestion du salon efficaces et intuitives.\n\nLa page d'accueil présente le nom du salon, une galerie de photos, et une liste détaillée des prestations classées par catégories (coiffure homme/femme, barbe, etc.), ainsi que des informations sur le salon, sa localisation, ses horaires et des vidéos de présentation. Le côté administrateur permet de visualiser en temps réel les réservations sur un calendrier, avec la possibilité d'ajouter ou de rechercher manuellement des rendez-vous.\n\nLes administrateurs peuvent gérer les prestations, créer de nouvelles catégories, modifier ou supprimer des offres existantes, et attribuer des icônes aux catégories. La gestion de l'équipe est également facilitée, permettant de définir les informations des coiffeurs, leurs horaires, leurs compétences, et leurs jours de travail.\n\nLe système de calendrier est hautement personnalisable, permettant de définir les politiques d'annulation, les rappels de rendez-vous, les conditions de réservation, et de planifier les fermetures pour congés ou jours fériés. Les paramètres du salon incluent les horaires, l'adresse, les informations de contact, et l'affichage de produits dans un catalogue interactif.\n\nL'API \"smspartner\" est utilisée pour la gestion des SMS, permettant l'envoi de rappels aux clients, avec un suivi détaillé des messages envoyés. Le menu client offre la possibilité de gérer les informations des clients, d'envoyer des communications directes, et de visualiser ou de modifier les réservations.\n\nDu côté client, l'utilisateur peut choisir une prestation, un coiffeur, et un créneau horaire. Les confirmations de réservation sont envoyées par email, avec la possibilité d'ajouter l'événement au calendrier personnel. Un historique de réservation est disponible, ainsi que des options pour annuler ou modifier les rendez-vous.\n\nEnfin, la page de statistiques offre une vue d'ensemble des performances du salon, avec des données sur les réservations, les prestations et prestataires populaires, et l'activité clientèle.\n\n\"Calendry\" est un exemple de ma capacité à développer des solutions web complètes, alliant fonctionnalité, esthétique, et facilité d'utilisation, pour optimiser la gestion et l'expérience client dans le secteur de la beauté et du bien-être.",
    "image": "projects/calendry.png",
    "link": "",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2022-10-19",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 12,
    "name": "Refonte du Site Web sous Wordpress",
    "slug": "edissyum-wordpress",
    "description": "La refonte complète du site web Edissyum pour mon alternance chez Edissyum, réalisée sur WordPress. Ce projet a été une opportunité de démontrer mes compétences en développement web et en gestion de contenu, ainsi que ma capacité à créer une plateforme en ligne qui met en valeur les services et l'expertise d'Edissyum dans le domaine de la gestion électronique de documents.\n\nLe site refondu présente nos solutions spécialisées, notamment MEM Courrier et Open Capture, en mettant l'accent sur notre expertise en solutions logicielles libres et en capture documentaire. Le site comprend des sections dédiées à nos références, des témoignages clients, ainsi que des formulaires de contact et d'inscription. Une partie importante du site est consacrée à un blog d'actualité, fournissant des informations régulières sur nos activités et nos domaines d'expertise.\n\nUne page dédiée à l'entreprise offre un aperçu de l'histoire d'Edissyum, incluant une visite virtuelle des bureaux que j'ai réalisée, ainsi qu'une vidéo de présentation. Chaque produit et service est détaillé sur des pages spécifiques, et une section carrière propose des informations sur les opportunités d'emploi et un formulaire de recrutement.\n\nLe site fonctionne sous WordPress avec Elementor, et a été conçu sans utiliser de template prédéfini. J'ai opté pour une approche personnalisée, en construisant le site de A à Z sur Elementor. L'accent a été mis sur l'optimisation SEO pour assurer une visibilité maximale sur les moteurs de recherche, et l'intégration de Google Analytics permet de suivre et d'analyser le trafic du site.\n\nLe panel administratif de WordPress facilite la gestion du contenu, permettant l'ajout de blogs, d'actualités et la modification de divers éléments du site. Ce projet illustre non seulement mes compétences techniques en matière de développement web, mais aussi ma capacité à créer des plateformes en ligne attrayantes et fonctionnelles qui reflètent fidèlement l'image et les valeurs d'une entreprise.",
    "image": "projects/edissyum.png",
    "link": "https://edissyum.com",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      403
    ],
    "tags": [
      "Wordpress"
    ],
    "date": "2022-09-10",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 22,
    "name": "Propositions pour DJ",
    "slug": "dj",
    "description": "DJ est une web app que j'ai développée pour faciliter les interactions entre les invités d'un événement et le DJ. Cette application propose un moyen moderne et interactif pour les participants de suggérer des musiques à jouer, rendant la soirée plus dynamique et personnalisée.\n\nLorsqu'un utilisateur visite le site, il est accueilli par un formulaire simple où il peut entrer son prénom, le titre de la musique souhaitée, l'artiste, et laisser un petit message pour le DJ. Cette fonctionnalité permet aux invités de participer activement à l'ambiance musicale de l'événement, en proposant des morceaux qui leur tiennent à cœur.\n\nPour le DJ, l'application offre un panel de connexion où il peut voir en temps réel toutes les propositions de musique faites par les invités. Il a la possibilité de passer en revue ces suggestions, de les accepter ou de les refuser, ce qui lui donne un contrôle total sur la playlist tout en tenant compte des préférences des invités.\n\nEn plus de la gestion des propositions musicales, l'application fournit des statistiques en temps réel, comme le nombre total de propositions effectuées au cours de la soirée. Cette fonctionnalité permet au DJ d'avoir une vue d'ensemble de l'engagement des invités et de l'impact de la musique sur l'ambiance de l'événement.\n\nDJ est un exemple de mon aptitude à développer des solutions web interactives et innovantes qui améliorent l'expérience utilisateur lors d'événements. Ce projet démontre mon intérêt pour la création d'outils numériques qui facilitent la communication et l'interaction dans des contextes sociaux et festifs. Pour l'occasion, j'avais réalisé et imprimé une affiche avec un QR code pour accéder à l'application facilement.",
    "image": "projects/dj.png",
    "link": "https://dj.mondon.pro",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "PHP",
      "MySQL"
    ],
    "date": "2022-06-31",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 14,
    "name": "Atmosph'air - PWA Qualité de l'Air",
    "slug": "atmosphair-pwa-qualite-de-l-air",
    "description": "Atmosph'Air est un projet étudiant que j'ai développé, une progressive web app conçue pour fournir des informations en temps réel sur la qualité de l'air dans différentes villes. Cette application utilise l'API d'Atmosud pour calculer et afficher ces données, offrant aux utilisateurs une interface intuitive et informative.\n\nSur la page d'accueil, les utilisateurs sont accueillis par des animations engageantes et un classement des trois bulletins les plus consultés, avec le nombre total de consultations. En cliquant sur une ville, comme Toulon par exemple, l'application affiche la qualité de l'air actuelle, le polluant majoritaire, et l'évolution de la qualité de l'air sur les 30 derniers jours, représentée par un graphique créé avec ChartJS.\n\nLes utilisateurs ont la possibilité de rechercher leur ville parmi toutes les villes de France disponibles dans l'API d'Atmosphère. Ils peuvent également ajouter des villes à leur liste de favoris, ce qui permet un accès rapide à la qualité de l'air de ces villes depuis la page d'accueil.\n\nLe mode administrateur de l'application offre des fonctionnalités avancées pour gérer la récupération des données. Il existe un \"mode rapide\", qui économise la bande passante en utilisant des données mises en cache, et un \"mode basique\". Pour optimiser les performances, l'application met à jour quotidiennement le cache en requêtant l'API pour obtenir les données au format JSON, qui sont ensuite stockées et utilisées pour les recherches, évitant ainsi les délais associés aux requêtes API en temps réel.\n\nL'application est également équipée d'un script PHP exécuté par une tâche cron, qui actualise toutes les 8 heures les données de la qualité de l'air de chaque ville et les stocke dans le cache JSON. Un bouton permet aux administrateurs de forcer manuellement cette actualisation des données.\n\nAtmosph'Air est un exemple de ma capacité à créer des solutions numériques utiles et innovantes, en combinant des technologies web modernes pour offrir une expérience utilisateur enrichissante et informative, tout en mettant l'accent sur l'optimisation des performances et la facilité d'utilisation.",
    "image": "projects/atmosphair.png",
    "link": "https://atmosphair.mondon.pro/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202
    ],
    "tags": [],
    "date": "2023-01-10",
    "status": "online",
    "type": "WebApp"
  },
  {
    "id": 4,
    "name": "Seamless Réseau Mistral Toulon",
    "slug": "seamless-reseau-mistral-toulon",
    "description": "Seamless est un projet sur lequel j'ai travaillé, visant à simplifier la validation des titres de transport pour le réseau de bus et de bateaux Mistral à Toulon. Cette application mobile offre une solution pratique et rapide pour les usagers des transports en commun.\n\nL'interface utilisateur de Seamless est conçue pour être intuitive et facile à utiliser. Après connexion, l'utilisateur se voit présenter un gros bouton pour confirmer son voyage. Lorsque l'appareil est placé sur la cible spécifique présente dans les bus et bateaux, l'application valide le voyage et affiche un écran de confirmation. Cette fonctionnalité assure une expérience de validation de titre de transport sans effort et sécurisée.\n\nEn plus de la fonction de validation, l'application inclut un onglet \"Contrôle\" où les utilisateurs peuvent voir l'historique de toutes leurs validations. Ils ont également la possibilité d'afficher un QR code, que les contrôleurs peuvent scanner pour vérifier la validité du ticket. Cela facilite les contrôles et rend l'expérience utilisateur plus fluide.\n\nCe projet illustre mon engagement à développer des solutions mobiles qui améliorent l'expérience quotidienne des utilisateurs, en mettant l'accent sur la facilité d'utilisation, la sécurité et l'efficacité. Seamless transforme l'interaction avec les services de transport en commun, en rendant le processus de validation des titres de transport aussi simple et fluide que possible.",
    "image": "projects/seamless.png",
    "link": "https://seamless.mondon.pro/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      202,
      301
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS",
      "MySQL"
    ],
    "date": "2021-09-20",
    "status": "development",
    "type": "WebApp"
  },
  {
    "id": 18,
    "name": "Site interactif style MacOS",
    "slug": "site-interactif-style-macos",
    "description": "Mon ancien portfolio était un site interactif inspiré par le style de l'interface utilisateur de macOS. Cette plateforme web offrait une expérience unique et engageante, reflétant mes compétences en design et en développement web.\n\nLa conception du site imitait l'interface de macOS, avec une barre de menu en haut, incluant un bouton pour un menu déroulant. Une des caractéristiques principales était la gestion de fenêtres, permettant aux utilisateurs d'agrandir, de réduire ou de fermer des fenêtres, simulant une expérience de multitâche. Plusieurs fenêtres pouvaient être ouvertes en même temps, offrant une navigation fluide et interactive.\n\nEn bas, une barre de tâches présentait des dossiers tels que \"Projet\" et \"Application\". Dans le dossier \"Projets\", mes travaux étaient affichés sous forme d'applications iOS. En cliquant sur ces icônes, une nouvelle fenêtre s'ouvrait, détaillant le projet avec un lien pour le tester. De même, le dossier \"Webapp\" regroupait les applications web que j'avais développées, chaque icône ouvrant une fenêtre pour une redirection facile.\n\nUne personnalisation supplémentaire était possible grâce à une application \"Paramètres\", permettant aux utilisateurs de modifier le fond d'écran du site. Ce changement était sauvegardé en local storage, assurant que le fond d'écran choisi reste même après l'actualisation de la page.\n\nDéveloppé en HTML, CSS, JavaScript et jQuery, ce portfolio était non seulement une vitrine de mes projets mais aussi une démonstration de ma créativité et de mes compétences techniques. L'utilisation d'un style similaire à celui de macOS était une manière originale de présenter mon travail, tout en offrant une expérience utilisateur agréable et familière.",
    "image": "projects/oldsite.png",
    "link": "https://projets.mondon.pro/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103,
      107
    ],
    "tags": [
      "Web Development",
      "portfolio"
    ],
    "date": "2020-02-18",
    "status": "online",
    "type": "Site web"
  },
  {
    "id": 19,
    "name": "GlucideCheck",
    "slug": "glucidecheck",
    "description": "GlucideCheck représente mon tout premier projet de développement, une progressive web app conçue pour aider les personnes diabétiques à gérer leur condition. Cette application a été une source d'inspiration pour moi et a joué un rôle crucial dans ma décision de poursuivre une carrière en développement.\n\nL'application a pour objectif principal de simplifier le calcul de la quantité d'insuline nécessaire en fonction des taux de glycémie. Sur la page d'accueil, l'utilisateur peut saisir son taux de glycémie actuel. L'application analyse ensuite ce taux et indique s'il est optimal, s'il correspond à une hyperglycémie (modérée, élevée ou sévère) et recommande la quantité d'insuline nécessaire pour atteindre un taux cible, par exemple 110.\n\nLes données les plus récentes saisies par l'utilisateur, ainsi que la date correspondante, sont stockées en local storage et sont affichées sur la page d'accueil pour un accès rapide. L'onglet \"Calcul\" permet aux utilisateurs de déterminer la quantité de glucides dans un aliment en fonction de ses valeurs nutritionnelles pour 100 g. Cette fonctionnalité offre une aide pratique pour gérer l'alimentation, un aspect crucial dans le traitement du diabète.\n\nDans un souci de personnalisation, GlucideCheck comprend également un onglet de paramètres. Les utilisateurs peuvent activer un mode sombre, choisir la langue (français ou anglais), définir leur taux cible d'insuline et ajuster l'impact d'une unité d'insuline sur leur glycémie. Toutes ces préférences sont enregistrées en local storage.\n\nBien que ce soit mon premier projet, et qu'il ne soit pas entièrement optimisé ou responsive, GlucideCheck a été extrêmement utile. Développé avec HTML, CSS et JavaScript, ce projet a non seulement été une réussite fonctionnelle, mais a également renforcé ma passion pour le développement web et la création de solutions numériques significatives.",
    "image": "projects/glucidecheck.png",
    "link": "https://projets.mondon.pro/glucidecheck",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS"
    ],
    "date": "2019-04-07",
    "status": "development",
    "type": "WebApp"
  },
  {
    "id": 23,
    "name": "MiniOS",
    "slug": "minios",
    "description": "MiniOS est un de mes premiers projets, une simulation de système d'exploitation accessible directement via un navigateur web. Ce projet m'a permis de développer mes compétences en JavaScript, en particulier dans la gestion des événements de clic et des affichages dynamiques.\n\nÀ l'ouverture de \"MiniOS\", les utilisateurs sont accueillis par une page de mise en veille, simulant une expérience utilisateur réaliste. En cliquant, ils ont la possibilité de se connecter pour accéder au bureau virtuel. Le design de l'interface est inspiré de Windows 10, avec un bureau comportant un raccourci vers les paramètres et un bouton Windows dans la barre des tâches pour accéder au menu principal.\n\nLes fonctionnalités incluses dans \"MiniOS\" sont :\n\nMenu Windows : Offre des options telles que \"Power\" pour éteindre ou mettre en veille le système et un accès rapide aux paramètres.\n\nParamètres Système : Permet aux utilisateurs de modifier l'affichage, comme l'ajustement de la luminosité, l'activation de l'éclairage nocturne ou des couleurs inversées.\n\nGestion de Compte : Les utilisateurs peuvent changer la photo de profil et le nom d'utilisateur.\n\nPersonnalisation : Permet de personnaliser le fond d'écran, avec les préférences enregistrées en local storage.\n\nBarre des Tâches : Inclut des fonctionnalités telles que l'affichage des icônes cachées, un indicateur de batterie avec une option d'économiseur de batterie, un bouton réseau pour activer/désactiver le mode avion, et l'heure actuelle avec un calendrier.\n\nBien que \"MiniOS\" soit un projet simple et pas entièrement complet, il a joué un rôle crucial dans mon apprentissage de la programmation. Il a été une plateforme expérimentale pour explorer et améliorer mes compétences en développement front-end, en me familiarisant avec des concepts fondamentaux tels que la manipulation du DOM et la gestion des interactions utilisateur. Ce projet illustre mon intérêt pour la création de simulations interactives et ma passion pour l'exploration de nouvelles idées dans le domaine du développement web.",
    "image": "projects/miniOS.png",
    "link": "https://projets.mondon.pro/miniOS/index_lockscreen.html",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS"
    ],
    "date": "2019-05-22",
    "status": "development",
    "type": "WebApp"
  },
  {
    "id": 27,
    "name": "Loup Garou",
    "slug": "loup-garou",
    "description": "Qui-Est-Ce ? est un jeu en ligne que j'ai conçu, inspiré du jeu classique de déduction et de questions. Ce projet, développé avec HTML, CSS et JavaScript pur, offre une expérience ludique et engageante, tout en mettant à l'épreuve les capacités de raisonnement et de déduction des joueurs.\n\nSur la page d'accueil, l'utilisateur trouve plusieurs options : jouer, crédits, paramètres pour activer ou désactiver les animations, et une section dédiée aux trophées et succès, comme gagner une partie ou en remporter 100. Toutes les données relatives aux succès et aux parties jouées sont stockées en local storage.\n\nEn cliquant sur \"Jouer\", les joueurs sont accueillis par un tableau de personnages générés aléatoirement avec divers attributs. À chaque nouvelle partie, les personnages et leurs attributs changent, offrant ainsi un défi renouvelé. À côté du tableau, les joueurs peuvent sélectionner et poser des questions pour éliminer les personnages qui ne correspondent pas aux indices obtenus. Par exemple, en posant la question \"a-t-il les cheveux longs?\" et en recevant une réponse affirmative, le joueur peut alors éliminer tous les personnages aux cheveux courts.\n\nLe jeu progresse avec des questions successives permettant de réduire le nombre de personnages jusqu'à ce qu'il n'en reste qu'un seul. Une fois le personnage correct identifié, un écran de victoire s'affiche avec des félicitations et une option pour rejouer.\n\nQui-Est-Ce ? est un exemple de mes premiers pas dans le développement web, démontrant ma capacité à créer des jeux interactifs et divertissants. Ce projet met en valeur mes compétences en programmation et mon intérêt pour le développement de jeux simples mais captivants.",
    "image": "projects/lg.png",
    "link": "https://projets.mondon.pro/lg/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS"
    ],
    "date": "2019-06-19",
    "status": "development",
    "type": "WebApp"
  },
  {
    "id": 20,
    "name": "Qui-Est-Ce ?",
    "slug": "qui-est-ce",
    "description": "Qui-Est-Ce ? est un jeu en ligne que j'ai conçu, inspiré du jeu classique de déduction et de questions. Ce projet, développé avec HTML, CSS et JavaScript pur, offre une expérience ludique et engageante, tout en mettant à l'épreuve les capacités de raisonnement et de déduction des joueurs.\n\nSur la page d'accueil, l'utilisateur trouve plusieurs options : jouer, crédits, paramètres pour activer ou désactiver les animations, et une section dédiée aux trophées et succès, comme gagner une partie ou en remporter 100. Toutes les données relatives aux succès et aux parties jouées sont stockées en local storage.\n\nEn cliquant sur \"Jouer\", les joueurs sont accueillis par un tableau de personnages générés aléatoirement avec divers attributs. À chaque nouvelle partie, les personnages et leurs attributs changent, offrant ainsi un défi renouvelé. À côté du tableau, les joueurs peuvent sélectionner et poser des questions pour éliminer les personnages qui ne correspondent pas aux indices obtenus. Par exemple, en posant la question \"a-t-il les cheveux longs?\" et en recevant une réponse affirmative, le joueur peut alors éliminer tous les personnages aux cheveux courts.\n\nLe jeu progresse avec des questions successives permettant de réduire le nombre de personnages jusqu'à ce qu'il n'en reste qu'un seul. Une fois le personnage correct identifié, un écran de victoire s'affiche avec des félicitations et une option pour rejouer.\n\nQui-Est-Ce ? est un exemple de mes premiers pas dans le développement web, démontrant ma capacité à créer des jeux interactifs et divertissants. Ce projet met en valeur mes compétences en programmation et mon intérêt pour le développement de jeux simples mais captivants.",
    "image": "projects/qui-est-ce.png",
    "link": "https://projets.mondon.pro/qui-est-ce/",
    "github": "",
    "youtube": [],
    "technos": [
      101,
      102,
      103
    ],
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "JS"
    ],
    "date": "2019-12-18",
    "status": "development",
    "type": "WebApp"
  }
]
